mathematica.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>A Brief Summary of Mathematica</title>
<!-- 2015-07-30 Thu 00:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="shaka" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">A Brief Summary of Mathematica</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Bracketing</a></li>
<li><a href="#sec-2">Constants</a></li>
<li><a href="#sec-3">Data objects</a></li>
<li><a href="#sec-4">Defining variables, functions, and rules</a></li>
<li><a href="#sec-5">Linear algebra</a></li>
<li><a href="#sec-6">Algebraic calculation</a></li>
<li><a href="#sec-7">Calculus</a></li>
<li><a href="#sec-8">Input and output</a></li>
<li><a href="#sec-9">Expression in different formats</a></li>
<li><a href="#sec-10">Programming</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Bracketing</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> Parenthesis () </dt><dd>change the priorities in computing.
</dd>
<dt> Square bracket [] </dt><dd>function parameters, e.g. <code>f[x]</code>.
</dd>
<dt> Curly brace {} </dt><dd>list, e.g. <code>{a, b, c}</code>.
</dd>
<dt> Double bracket [[]] </dt><dd>abbreviation of <code>Part</code>, e.g. <code>v[[i]]</code>.
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Constants</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command</th>
<th scope="col" class="left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Pi</td>
<td class="left">\(\pi\)</td>
</tr>

<tr>
<td class="left">E</td>
<td class="left">\(e\)</td>
</tr>

<tr>
<td class="left">I</td>
<td class="left">\(i = \sqrt{-1}\)</td>
</tr>

<tr>
<td class="left">Infinity</td>
<td class="left">\(\infty\)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Data objects</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">2 + 8 I</td>
<td class="left">complex</td>
</tr>

<tr>
<td class="left">"text"</td>
<td class="left">string</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Defining variables, functions, and rules</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">x = value</td>
<td class="left">assignment</td>
</tr>

<tr>
<td class="left">x := value</td>
<td class="left">delayed assignment</td>
</tr>

<tr>
<td class="left">x = . or Clear[x]</td>
<td class="left">remove value assigned to <code>x</code></td>
</tr>

<tr>
<td class="left">f[x_] := expression</td>
<td class="left">define a function <code>f(x)</code></td>
</tr>

<tr>
<td class="left">expression /. x-&gt;a</td>
<td class="left">replace <code>x</code> by a in expression</td>
</tr>

<tr>
<td class="left">expression //. x-&gt;a</td>
<td class="left">replace repeatedly</td>
</tr>

<tr>
<td class="left">lhs :&gt; rhs /; test</td>
<td class="left">apply rule if <code>test</code> is True</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Linear algebra</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">{a, b, c}</td>
<td class="left">vector, list</td>
</tr>

<tr>
<td class="left">{{a, b}, {c, d}}</td>
<td class="left">2 &times; 2 matrix</td>
</tr>

<tr>
<td class="left">n.m</td>
<td class="left">matrix multiply</td>
</tr>

<tr>
<td class="left">Inverse[m]</td>
<td class="left">inverse of matrix</td>
</tr>

<tr>
<td class="left">Transpose[m]</td>
<td class="left">transpose</td>
</tr>

<tr>
<td class="left">Det[m]</td>
<td class="left">determinant</td>
</tr>

<tr>
<td class="left">MatrixPower[m, n]</td>
<td class="left">m^n</td>
</tr>

<tr>
<td class="left">MatrixExp[m]</td>
<td class="left">e^m</td>
</tr>

<tr>
<td class="left">LinearSolve[m, b]</td>
<td class="left">solve mx = b</td>
</tr>

<tr>
<td class="left">Eigenvalues[m]</td>
<td class="left">eigenvalues</td>
</tr>

<tr>
<td class="left">Eigenvectors[m]</td>
<td class="left">eigenvectors</td>
</tr>

<tr>
<td class="left">Eigensystem[m]</td>
<td class="left">eigenvalues and eigenvectors</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Algebraic calculation</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Solve[lhs==rhs, x]</td>
<td class="left">solve algebraic equation for x</td>
</tr>

<tr>
<td class="left">DSolve[eqn, y[x], x]</td>
<td class="left">solve differential equation</td>
</tr>

<tr>
<td class="left">Reduce[eqn, x]</td>
<td class="left">reduce equations</td>
</tr>

<tr>
<td class="left">Eliminate[eqn, x]</td>
<td class="left">eliminate variable x</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Calculus</h2>
<div class="outline-text-2" id="text-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">D[f, x]</td>
<td class="left">\(\partial f/\partial x\)</td>
</tr>

<tr>
<td class="left">D[f, {x,n}</td>
<td class="left">\(\partial^n f/\partial x^n\)</td>
</tr>

<tr>
<td class="left">Dt[f]</td>
<td class="left">\(df\)</td>
</tr>

<tr>
<td class="left">Integrate[f, x]</td>
<td class="left">\(\int fdx\)</td>
</tr>

<tr>
<td class="left">Integrate[f, {x, a, b}]</td>
<td class="left">\(\int_a^b f dx\)</td>
</tr>

<tr>
<td class="left">Sum[f, {i, m, n}]</td>
<td class="left">\(\sum_{i=m}^n f\)</td>
</tr>

<tr>
<td class="left">Product[f, {i, m, n}]</td>
<td class="left">\(\prod_{i=m}^n f\)</td>
</tr>

<tr>
<td class="left">Limit[f, x-&gt;a]</td>
<td class="left">\(\lim_{x\to a} f\)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Input and output</h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&lt;&lt;file</td>
<td class="left">read expressions from <code>file</code>, return last expression.</td>
</tr>

<tr>
<td class="left">expression&gt;&gt;file</td>
<td class="left">write <code>expression</code> to <code>file</code>.</td>
</tr>

<tr>
<td class="left">expression&gt;&gt;&gt;file</td>
<td class="left">append <code>expression</code> to <code>file</code>.</td>
</tr>

<tr>
<td class="left">!!file</td>
<td class="left">display the content of <code>file</code>.</td>
</tr>

<tr>
<td class="left">Save["file", x]</td>
<td class="left">save the definition of <code>x</code> to <code>file</code>.</td>
</tr>

<tr>
<td class="left">!command</td>
<td class="left">issue a UNIX command.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Expression in different formats</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Command</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">FullForm[e]</td>
<td class="left">full form</td>
</tr>

<tr>
<td class="left">InputForm[e]</td>
<td class="left">input</td>
</tr>

<tr>
<td class="left">OutputForm[e]</td>
<td class="left">out</td>
</tr>

<tr>
<td class="left">CForm[e]</td>
<td class="left">C codes</td>
</tr>

<tr>
<td class="left">FortranForm</td>
<td class="left">fortran</td>
</tr>

<tr>
<td class="left">MatrixForm[e]</td>
<td class="left">matrix</td>
</tr>

<tr>
<td class="left">StandardForm[e]</td>
<td class="left">math</td>
</tr>

<tr>
<td class="left">TeXForm[e]</td>
<td class="left">TEX</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Programming</h2>
<div class="outline-text-2" id="text-10">
<dl class="org-dl">
<dt> Table[expression, {i, max}] </dt><dd>make a list of values of <code>expression</code> with <code>i</code> from <code>1</code> to <code>max</code>.
</dd>
<dt> Module[{a, b, c}, expression1; expression2;&#x2026;] </dt><dd>a procedure with local variables <code>a</code>, <code>b</code>, <code>c</code> return value of last expression.
</dd>
<dt> Do[expression, {i, min, max, di}] </dt><dd>evaluate <code>expression</code> with <code>i</code> run from <code>min</code> to <code>max</code> in steps of <code>di</code>.
</dd>
<dt> While[test, body] </dt><dd>evaluate <code>body</code> repeatedly, so long as <code>test</code> is <code>True</code>.
</dd>
<dt> For[star,test,inc,body] </dt><dd>evaluate <code>start</code>, then repeatedly evaluate <code>body</code> and <code>inc</code>, until <code>test</code> fails.
</dd>
<dt> If[test, then, else] </dt><dd>evaluate <code>then</code> if <code>test</code> is <code>True</code>, and <code>else</code> if it is <code>False</code>.
</dd>
<dt> Which[test1,value1,test2,value2,&#x2026;] </dt><dd>give the value associated with the first <code>test</code> that is <code>True</code>.
</dd>
<dt> Switch[expression, form1, value1, form2, value2, &#x2026;] </dt><dd>give the value associated with first <code>form</code> matching <code>expression</code>.
</dd>
<dt> Function[x, body] </dt><dd>specify a pure function.
</dd>
<dt> Nest[f, x, n] </dt><dd>apply the function <code>f</code> nested <code>n</code> times to <code>x</code>.
</dd>
<dt> Apply[f, {a, b, c}] </dt><dd><code>f(a, b, c)</code>.
</dd>
<dt> Map[f, {a, b, c}] </dt><dd>apply <code>f</code> to each elements, <code>{f(a), f(b), f(c)}</code>.
</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: shaka</p>
<p class="date">Created: 2015-07-30 Thu 00:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
